app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    byebug
    @posts = Post.all

INSERT INTO "posts" ("title", "body", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "23"], ["body", "233"], ["published", false], ["created_at", 2016-08-18 18:06:32 UTC], ["updated_at", 2016-08-18 18:06:32 UTC]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save